app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
    def new
        @cat_rental_request = CatRentalRequest.new
        @cats = Cat.all

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 5], ["start_date", "2021-06-28"], ["end_date", "2021-06-30"], ["created_at", "2021-06-26 03:19:53.107002"], ["updated_at", "2021-06-26 03:19:53.107002"]]
SELECT "cats".* FROM "cats"
---
    def create
        @cat_rental_request = CatRentalRequest.new(cat_rental_request_params)
        if @cat_rental_request.save
            redirect_to cat_url(cat_rental_request_params[:cat_id])
        else
            @cats = Cat.all

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "cats".* FROM "cats"
---
    def approve
        @cat_rental_request = CatRentalRequest.find(params[:id])
        @cat = Cat.where('params[:cat_id] = ?', 'cat.id')
        @cats = Cat.all

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "cats".* FROM "cats"
---
    def deny
        @cat_rental_request = CatRentalRequest.find(params[:id])
        @cat = Cat.where('params[:cat_id] = ?', 'cat.id')
        @cats = Cat.all