app/models/cat_rental_request.rb

    def does_not_overlap_approved_request
        if self.overlapping_approved_requests.where('cat_id = ?', self.cat_id).exists?
---
SELECT  1 AS one FROM "cat_rental_requests" WHERE NOT (start_date > '2021-06-30' OR end_date < '2021-06-28' OR id = 2) AND (status = 'APPROVED') AND (cat_id != 5) LIMIT $1  [["LIMIT", 1]]

    def deny!
        self.status = "DENIED"
        self.save!
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2021-07-01 06:31:43.984017"], ["id", 13]]

    def approve!
        if self.overlapping_pending_requests.length > 0
            self.overlapping_pending_requests.transaction do |request|
                request.deny!
                request.save
            end
            self.status = "APPROVED"
            self.save!
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE NOT (start_date > '2021-06-30' OR end_date < '2021-06-28' AND id != 2) AND (status = 'PENDING')
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2021-06-29 23:05:59.924531"], ["id", 2]]